app/controllers/prayers_controller.rb

SELECT "prayers".* FROM "prayers"  ORDER BY created_at DESC
---
def index
@prayers = Prayer.all.order('created_at DESC')

SELECT  "prayers".* FROM "prayers" WHERE "prayers"."id" = $1 LIMIT 1  [["id", 1]]
---
 def show

 @prayer = Prayer.find(params[:id])

INSERT INTO "prayers" ("title", "content", "created_by", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
def create
 @prayer = Prayer.new(prayer_params)
    if @prayer.save